Revit 2027 API
IFCLinkDocumentExportScope.Dispose Method
Releases all resources used by the IFCLinkDocumentExportScope
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Dispose()
Public Sub Dispose
public:
virtual void Dispose() sealed
abstract Dispose : unit -> unit
override Dispose : unit -> unit
Implements
IDisposable.Dispose()
See Also
Reference
IFCLinkDocumentExportScope Class
Autodesk.Revit.DB.IFC Namespace